{
    "Feynman Technique": {
        "description": "Named after the renowned physicist Richard Feynman, this technique emphasizes teaching a concept you want to learn in simple terms as if teaching it to someone else. It involves four steps: choose a concept, teach it, identify gaps, and review and simplify.",
        "ideal_for": "Understanding complex concepts in depth."
    },
    "Spaced Repetition": {
        "description": "Involves reviewing the learning material over increasing intervals of time. It leverages the psychological spacing effect, suggesting that learning is more effective when spread out over time.",
        "ideal_for": "Long-term memorization of facts, formulas, or vocabulary."
    },
    "Active Recall": {
        "description": "Active Recall involves actively engaging with the material through self-testing rather than passively reading or re-reading. This approach forces the brain to retrieve information from memory, strengthening the learning process and improving memory retention.",
        "ideal_for": "Enhancing retention of lecture material, book chapters, or any subject matter requiring memorization and understanding."
    },
    "Pomodoro Technique": {
        "description": "The Pomodoro Technique involves breaking down work into short, timed intervals (traditionally 25 minutes) followed by short breaks. This method aims to improve focus and maintain productivity by providing structured time management and regular rest periods.",
        "ideal_for": "Managing time effectively, especially during long study sessions or projects, and preventing burnout."
    },
    "Mind Mapping": {
        "description": "Mind Mapping is a visual organization strategy, creating diagrams that map out information around a central subject. It helps in brainstorming, planning projects, and summarizing information, allowing for a creative and structured way to visualize ideas.",
        "ideal_for": "Organizing thoughts, brainstorming sessions, and summarizing large amounts of information."
    },
    "Dual Coding": {
        "description": "Dual Coding combines verbal and visual information to help remember facts. It's based on the cognitive theory that the brain processes verbal and visual information in two distinct ways, and combining these can enhance learning and recall.",
        "ideal_for": "Subjects that benefit from visualization, such as anatomy, geography, and history, or any topic where diagrams and text can complement each other."
    },
    "Practice Testing": {
        "description": "Practice Testing involves creating or taking practice exams under timed conditions, simulating the environment of an actual exam. This method helps with both familiarity with the material and reducing test anxiety by mimicking the pressure of exam conditions.",
        "ideal_for": "Exam preparation across all subjects, especially where formal assessments are a key part of the curriculum."
    },
    "Interleaved Practice": {
        "description": "Interleaved Practice is a study technique where different topics or subjects are mixed together during study sessions. This method challenges the brain to adapt and apply different strategies, enhancing problem-solving skills and deepening understanding.",
        "ideal_for": "Studying subjects that cover a wide range of topics or skills, such as mathematics, science, and language learning."
    },
    "Elaborative Interrogation": {
        "description": "Elaborative Interrogation is a questioning technique that enhances learning by asking 'how' and 'why' questions about the material being studied. It encourages connecting new information to existing knowledge, deepening understanding through elaboration.",
        "ideal_for": "Subjects that require comprehensive understanding over rote memorization, such as social sciences, literature, and complex theoretical topics."
    }
}